IDEA Open Model
IdeaSMemberImportSettings Properties
Compatible with IDEA StatiCa Beta 20.0
The IdeaSMemberImportSettings type exposes the following members.
Properties
Name | Description
CanChangeDesignCodeInWizard
 Can change design code in Wizard
 (Inherited from IdeaConImportSettings.)
ConnectionFileName
 Gets or sets the name of the Connection project
 (Inherited from IdeaConImportSettings.)
DefaultBoltAssembly
 Gets or sets the name of the default bolt assembly
 (Inherited from IdeaConImportSettings.)
DefaultSteelMaterial
 Gets or sets the name of the default material of plates which are added from the template
 (Inherited from IdeaConImportSettings.)
DefaultWeldMaterial
 Gets or sets the name of the default weld material
 (Inherited from IdeaConImportSettings.)
DesignCode
 Gets or sets the Design Code There can be : ECEN AISC CISC RUS
 (Inherited from IdeaConImportSettings.)
ExportAllLinearCombination
 All linear combination will be exported to IDEA connection
 (Inherited from IdeaConImportSettings.)
OnePageWizard
 One page wizard
 (Inherited from IdeaConImportSettings.)
OrderMembersById
 If true, connected members in connection are ordered acoording to topological rules othewise by their IDs.
 (Inherited from IdeaConImportSettings.)
RunningApplication
 Running application
 (Inherited from IdeaConImportSettings.)
StartIdeaStaticaApp
 StartIdeaStaticaApp
 (Inherited from IdeaConImportSettings.)
UserWizardBrand
 Set user Wizard Brand
 (Inherited from IdeaConImportSettings.)
UseWizard
 Open import wizard window
 (Inherited from IdeaConImportSettings.)
WaitForExit
 WaitForExit
 (Inherited from IdeaConImportSettings.)
Top
See Also
Reference
IdeaSMemberImportSettings Class
IdeaRS.OpenModel.Connection Namespace